# Veri Manipulasyonu 201: Pandas

1. sozlukten Dataframe olusturma:  pd.DataFrame()

In [159]:
isimler = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
direks_sag =  [True, False, False, False, True, True, True]
arac_sayisi = [809, 731, 588, 18, 200, 70, 45]   # 10bin kisi basina dusen arac sayisi

# pandas kutuphanesini import ediniz
import pandas as pd

# verilen listeleri kullanarak sozlugum adli bir sozluk olusturunuz. 
# degisken adlari:  ulkeler,  direksiyon_sag,  arac_sayisi
sozlugum = { 'ulkeler':isimler, 'direksiyon_sag':direks_sag, 'arac_sayisi':arac_sayisi}

# 'sozlugum' adli sozluk u Dataframe e ceviriniz: 'araclar' ismi ile kaydediniz
araclar = pd.DataFrame(sozlugum)

# bu dataframe i yazdiriniz
print(araclar)

         ulkeler  direksiyon_sag  arac_sayisi
0  United States            True          809
1      Australia           False          731
2          Japan           False          588
3          India           False           18
4         Russia            True          200
5        Morocco            True           70
6          Egypt            True           45

2. gozlem indeksleri atama: df.index =

In [160]:
satir_indeksleri = ['US', 'AUS', 'JAP', 'IN', 'RU', 'MOR', 'EG']
# verilen diziyi araclar dataframe inin indeksi icin kullaniniz (atayiniz)
araclar.index = satir_indeksleri
# araclar dataframe ini tekrar yazdiriniz
print(araclar)

           ulkeler  direksiyon_sag  arac_sayisi
US   United States            True          809
AUS      Australia           False          731
JAP          Japan           False          588
IN           India           False           18
RU          Russia            True          200
MOR        Morocco            True           70
EG           Egypt            True           45

3. csv dosyasi okuma:

In [206]:
# pandas i import ediniz:
import pandas as pd
# cars.csv  dosyasini cars adi ile kaydediniz
cars = pd.read_csv('cars.csv', sep=',')
# cars verisinin ilk 5 gozlemini yazdiriniz
print(cars.head())
#cars.rename(columns={'Unnamed: 0':'CA'}, inplace=True)
#cars.rename(columns={Unnamed: 0})
# cars.columns[0] = ["kisa_ad"]     unnamed: 0  kolonunun ismini degistirebilirsiniz
cars.rename({'Unnamed: 0': 'kisa_ad'}, axis = 1)

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True

  kisa_ad  cars_per_cap        country  drives_right
0      US           809  United States          True
1     AUS           731      Australia         False
2     JAP           588          Japan         False
3      IN            18          India         False
4      RU           200         Russia          True
5     MOR            70        Morocco          True
6      EG            45          Egypt          True

4. ilk kolonu satirlarin indeksi olarak acmak icin kulanilan arguman:  index_col = 0

In [210]:
# ilk sutun gozlemlerin indeksi olarak belirlenmis olarak csv dosyasini okuyunuz:
cars = pd.read_csv('cars.csv', index_col = 0)
# cars verisini tekrar yazdiriniz
print(cars)

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

5. Koseli parantezle degisken secme :

In [211]:
# country degiskenini bir Pandas Series olarak yazdiriniz
print(cars['country'])

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object

In [212]:
# country degiskenini bir  Pandas DataFrame olarak yazdiriniz
print(cars[['country']])

           country
US   United States
AUS      Australia
JAP          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt

In [213]:
# dataframe in sadece country ve drives_right degiskenlerini secerek yazdiriniz
#print(cars.iloc[:,2:4])
print(cars[['country','drives_right']])

           country  drives_right
US   United States          True
AUS      Australia         False
JAP          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

6. Koseli parantezle gozlem secme :

In [214]:
# cars verisinin ilk 3 gozlemi yazdiriniz
cars.head(3)

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False

In [215]:
# 4. 5. ve 6. gozlemleri yazdiriniz
print(cars[4:7])
#a = [0, 1, 2, 3]
#print(cars.drop(a, axis = 0))

     cars_per_cap  country  drives_right
RU            200   Russia          True
MOR            70  Morocco          True
EG             45    Egypt          True

7. loc ve iloc:

In [221]:
# sadece Japonya ya ait bilgileri yazdiriniz
print(cars.loc[['JAP']])

     cars_per_cap country  drives_right
JAP           588   Japan         False

In [225]:
#cars.iloc[2:3,:]
cars.iloc[[2]]
#cars.iloc[2]

     cars_per_cap country  drives_right
JAP           588   Japan         False

In [227]:
# Avusturya ve Misira ait bilgileri yazdiriiniz
print(cars.iloc[[1, 6]])

     cars_per_cap    country  drives_right
AUS           731  Australia         False
EG             45      Egypt          True

8. loc ve iloc 2:

In [231]:
print(cars.loc[['AUS','EG']])

     cars_per_cap    country  drives_right
AUS           731  Australia         False
EG             45      Egypt          True

In [236]:
# Morocco a ait drives_right bilgisini yazdiriniz
cars.loc[["MOR"], "drives_right"]

MOR    True
Name: drives_right, dtype: bool

In [240]:
# rusya ve morocco nun country ve drives_right bilgilerini yazdiriniz:
cars.loc[['RU','MOR'],'country':'drives_right']

     country  drives_right
RU    Russia          True
MOR  Morocco          True

9. loc ve iloc 3:

In [241]:
# drives_right kolonunu(degiskenini) bir Series olarak yazdiriniz:
print(cars.loc[:,'drives_right'])

US      True
AUS    False
JAP    False
IN     False
RU      True
MOR     True
EG      True
Name: drives_right, dtype: bool

In [242]:
# drives_right kolonunu(degiskenini) bir DataFrame olarak yazdiriniz:
print(cars.loc[:,['drives_right']])

     drives_right
US           True
AUS         False
JAP         False
IN          False
RU           True
MOR          True
EG           True

In [245]:
# cars_per_cap ve drives_right kolonlarini(degiskenlerini) bir DataFrame olarak yazdiriniz:
print(cars.loc[:,['drives_right','cars_per_cap']])

     drives_right  cars_per_cap
US           True           809
AUS         False           731
JAP         False           588
IN          False            18
RU           True           200
MOR          True            70
EG           True            45

10. Pandas DataFrame uzerinde filtreleme:     df[df['column1']]

In [246]:
# sag direksiyonlu olanlari ifade eden drives_right kolonunu bir Series olarak dr adiyla kaydediniz: dr
dr = cars['drives_right']

In [247]:
#  dr i kullanarak cars dataframini filtreleyiniz, secilen adi ile kaydediniz: secilen
# (burada dr icindeki True lara karsilik gelen gozlemleri secilir, digerleri secilmez)
secilen = cars[ dr ]

# secilen  dataframini yazdiriniz
print(secilen)

     cars_per_cap        country  drives_right
US            809  United States          True
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

11. tek satirda ayni islem:

In [248]:
# Yukaridaki secme isleminin aynisini tek satirda yapiniz:
secilen = cars[cars['drives_right']]

# secilen  dataframe ini yazdiriniz:
print(secilen)

     cars_per_cap        country  drives_right
US            809  United States          True
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

12. Filtreleme-Secme 2:

In [249]:
# cars_per_cap degeri 500 den buyuk olan degerleri seciniz. bu veriyi  car_maniac  adiyla kaydediniz 
car_maniac = cars['cars_per_cap'] 
#  car_maniac  verisini yazdiriniz
print(car_maniac)

US      True
AUS     True
JAP     True
IN     False
RU     False
MOR    False
EG     False
Name: cars_per_cap, dtype: bool

13. Filtreleme-Secme 3:

BILGI:
cpc = cars['cars_per_cap']
cars[ (cpc > 10) & (cpc < 80) ]
veya 
cpc = cars['cars_per_cap']
cars[ np.logical_and(cpc > 10, cpc < 80) ]

In [257]:
import numpy as np
# cars_per_cap degeri 500 den buyuk ve 100 den kucuk olan degerleri seciniz. bu veriyi  medium  adiyla kaydediniz
cpc = cars['cars_per_cap']
medium = cars[ np.logical_and(cpc > 500, cpc < 100)]
#medium = cars[ (cpc > 500) & (cpc < 100) ]
# medium u yazdiriniz
print(medium)

Empty DataFrame
Columns: [cars_per_cap, country, drives_right]
Index: []

14. DataFrame uzerinde dongu

BILGI:
for idx, satir in df.iterrows() :

In [414]:
# cars uzerinde for ile dongu kurarak degisken adini ve o degiskenin gozlemlerini yazdiriniz
for idx, satir in cars.iterrows():
    print(idx)
    print(satir)
    print('\n')

US
cars_per_cap              809
country         United States
drives_right             True
COUNTRY         UNITED STATES
Name: US, dtype: object


AUS
cars_per_cap          731
country         Australia
drives_right        False
COUNTRY         AUSTRALIA
Name: AUS, dtype: object


JAP
cars_per_cap      588
country         Japan
drives_right    False
COUNTRY         JAPAN
Name: JAP, dtype: object


IN
cars_per_cap       18
country         India
drives_right    False
COUNTRY         INDIA
Name: IN, dtype: object


RU
cars_per_cap       200
country         Russia
drives_right      True
COUNTRY         RUSSIA
Name: RU, dtype: object


MOR
cars_per_cap         70
country         Morocco
drives_right       True
COUNTRY         MOROCCO
Name: MOR, dtype: object


EG
cars_per_cap       45
country         Egypt
drives_right     True
COUNTRY         EGYPT
Name: EG, dtype: object

BILGI:
for idx, satir in df.iterrows() :
    print(satir['country'])

15. DataFrame uzerinde dongu-2

US: 809
AUS: 731
JAP: 588
IN: 18
RU: 200
MOR: 70
EG: 45

In [268]:
# bir ustteki hucrede yazilan ciktiyi veren kodlari yaziniz. (cars dataframe'inin uzerinde dongu kullanarak)
for idx, satir in cars.iterrows() :
    print(idx, satir['cars_per_cap'])

US 809
AUS 731
JAP 588
IN 18
RU 200
MOR 70
EG 45

16. Dongu ile dataframe'e ait olan bir degiskeni alip, bir islem yapip baska bir degisken olarak dataframe'e ekleme

In [293]:
# Cars verisi uzerinde goruldugu gibi country adli bir degisken(kolon) var. df uzerinde for dongusu ile bu degiskeni kullanip 
# ayni ulke isimlerinin buyuk harfli halini barindiran yeni bir degisken olusturup bu veriye ekleyiniz.
# yeni degiskenin adi: COUNTRY seklinde olsun

for index, row in cars.iterrows(): 
    cars["COUNTRY"] = cars["country"].str.upper()
    #print (row["country"].upper())
    
# df i yazdiriniz
print(cars)

     cars_per_cap        country  drives_right        COUNTRY
US            809  United States          True  UNITED STATES
AUS           731      Australia         False      AUSTRALIA
JAP           588          Japan         False          JAPAN
IN             18          India         False          INDIA
RU            200         Russia          True         RUSSIA
MOR            70        Morocco          True        MOROCCO
EG             45          Egypt          True          EGYPT

17. dongu yerine .apply() methodu:

BILGI: Asagida verilen iki kod parcacigi ayni isi yapar:

for degisken, gozlem in df.iterrows() :
    df.loc[degisken, "name_length"] = len(gozlem["country"])

df["name_length"] = df["country"].apply(len)

In [291]:
import pandas as pd
# cars verisinin ilk halini tekrar cagiralim:
cars = pd.read_csv('cars.csv', index_col = 0)

# 16. adimda yapilan ayni seyi .apply(str.upper)  yontemi ile yapiniz. (Bilgiye dikkat!)
cars["COUNTRY"] = cars["country"].apply(str.upper)

# cars df sini yazdiriniz
print(cars)

     cars_per_cap        country  drives_right        COUNTRY
US            809  United States          True  UNITED STATES
AUS           731      Australia         False      AUSTRALIA
JAP           588          Japan         False          JAPAN
IN             18          India         False          INDIA
RU            200         Russia          True         RUSSIA
MOR            70        Morocco          True        MOROCCO
EG             45          Egypt          True          EGYPT

## homeless_data verisi uzerinde calisalim:

In [294]:
import pandas as pd
df = pd.read_pickle("homeless_data.pkl")

18. df nin ilk bes gozlemini yazdirin

In [295]:
df.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
2            Mountain     Arizona       7259.0          2606.0    7158024
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588

19. df hakkinda yapisal bilgileri yazdirin

In [296]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   region          51 non-null     object
 1   state           51 non-null     object
 2   individuals     51 non-null     float64
 3   family_members  51 non-null     float64
 4   state_pop       51 non-null     int64
dtypes: float64(2), int64(1), object(2)
memory usage: 2.4+ KB

20. df 'nin boyutunu yazdirin

In [199]:
df.shape

(51, 5)

21. df'in degiskenlerinin istatistiklerini yazdirin

In [201]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
individuals,51.0,7.225784e+03,1.599103e+04,434.0,1446.5,3082.0,6781.5,109008.0
family_members,51.0,3.504882e+03,7.805412e+03,75.0,592.0,1482.0,3196.0,52070.0
state_pop,51.0,6.405637e+06,7.327258e+06,577601.0,1777413.5,4461153.0,7340946.5,39461588.0

22. df'i iki boyutlu numpy arrayi olarak yazdirin

In [298]:
print(type(df.values))

<class 'numpy.ndarray'>

23. df'in degisken(kolon) isimlerini bir baska degisle kolon index isimlerini yazdirin

In [299]:
print(df.columns)

Index(['region', 'state', 'individuals', 'family_members', 'state_pop'], dtype='object')

In [204]:
df.columns[2]

'individuals'

24. df'in gozlem(satir) indekslerini yazdirin

In [300]:
print(df.index)

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
            34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
            50],
           dtype='int64')

25. df.sort_values('variable_name')

In [415]:
# df i  individual degiskenine gore siralayiniz.  df_ind ile kaydediniz
df_ind = df.sort_values('individuals')

# df_ind  in ilk 5 gozlemini yazdiriniz
df_ind.head()

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
50,Mountain,Wyoming,434.0,205.0,577601,639.0,0.679186,7.513837
34,West North Central,North Dakota,467.0,75.0,758080,542.0,0.861624,6.160300
7,South Atlantic,Delaware,708.0,374.0,965479,1082.0,0.654344,7.333148
39,New England,Rhode Island,747.0,354.0,1058287,1101.0,0.678474,7.058577
45,New England,Vermont,780.0,511.0,624358,1291.0,0.604183,12.492833

26. df.sort_values('variable_name', ascending=False )

In [416]:
# df i family members degiskenine gore tersten (buyukten kucuge) siralayiniz.    df_fam adi ile kaydediniz 
# (ascending=duz=kucukten buyuge)
df_fam = df.sort_values('family_members', ascending = False)

# df_fam in ilk 5 gozlemini yazdiriniz
df_fam.head()

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
32,Mid-Atlantic,New York,39827.0,52070.0,19530351,91897.0,0.433387,20.392363
4,Pacific,California,109008.0,20964.0,39461588,129972.0,0.838704,27.623825
21,New England,Massachusetts,6811.0,13257.0,6882635,20068.0,0.339396,9.895919
9,South Atlantic,Florida,21443.0,9587.0,21244317,31030.0,0.691041,10.093523
43,West South Central,Texas,19199.0,6111.0,28628666,25310.0,0.758554,6.706215

27. df.sort_values(['variable_name1','variable_name2'], ascending=[False,False] )

In [417]:
# df i region degiskenine gore duz ve bu siralamanin uzerine ayni zamanda family members degiskenine gore tersten siralayiniz.    
# df_reg_fam adi ile kaydediniz 
df_reg_fam = df.sort_values(['region','family_members'], ascending = [True,False])

# df_reg_fam in ilk 5 gozlemini yazdiriniz
df_reg_fam.head()

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
13,East North Central,Illinois,6752.0,3891.0,12723071,10643.0,0.634408,5.306895
35,East North Central,Ohio,6929.0,3320.0,11676341,10249.0,0.676066,5.934222
22,East North Central,Michigan,5209.0,3142.0,9984072,8351.0,0.623758,5.217310
49,East North Central,Wisconsin,2740.0,2167.0,5807406,4907.0,0.558386,4.718113
14,East North Central,Indiana,3776.0,1482.0,6695497,5258.0,0.718144,5.639611

28. var = df['variable_name']

In [419]:
#  individuals  degiskenini seciniz ve individuals adi ile kaydediniz
individuals = df['individuals']

# individuals in ilk 5 gozlemini yazdiriniz
individuals.head()

0      2570.0
1      1434.0
2      7259.0
3      2280.0
4    109008.0
Name: individuals, dtype: float64

29. df[['variable_name1','variable_name2']]

In [311]:
# state ve family_members degiskenlerini seciniz:   state_fam 
state_fam = df[['state','family_members']]

# sonucun bas kismini yazdiriniz
print(state_fam.head())

        state  family_members
0     Alabama           864.0
1      Alaska           582.0
2     Arizona          2606.0
3    Arkansas           432.0
4  California         20964.0

In [312]:
# individuals ve state columns degiskenlerini seciniz:  ind_state
ind_state = df[['individuals','state']]

# sonucun bas kismini yazdiriniz
print(ind_state.head())

   individuals       state
0       2570.0     Alabama
1       1434.0      Alaska
2       7259.0     Arizona
3       2280.0    Arkansas
4     109008.0  California

30. df[ df['variable'] > 100 ]

In [418]:
# individuals degerinin  10000  den fazla oldugu gozlemleri seciniz:  ind_buyuk_10k
ind_buyuk_10k = df[df['individuals']>10000]
# ind_buyuk_10k u yazdiriniz
ind_buyuk_10k

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
4,Pacific,California,109008.0,20964.0,39461588,129972.0,0.838704,27.623825
9,South Atlantic,Florida,21443.0,9587.0,21244317,31030.0,0.691041,10.093523
32,Mid-Atlantic,New York,39827.0,52070.0,19530351,91897.0,0.433387,20.392363
37,Pacific,Oregon,11139.0,3337.0,4181886,14476.0,0.769481,26.636307
43,West South Central,Texas,19199.0,6111.0,28628666,25310.0,0.758554,6.706215
47,Pacific,Washington,16424.0,5880.0,7523869,22304.0,0.736370,21.829195

31. df[ df['variable']=='example' ]

In [420]:
#  region degiskeni  Mountain  olan gozlemleri deciniz:  mountain_reg
mountain_reg = df[df['region']=='Mountain']

# sonucu gorelim
mountain_reg

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
2,Mountain,Arizona,7259.0,2606.0,7158024,9865.0,0.735834,10.141067
5,Mountain,Colorado,7607.0,3250.0,5691287,10857.0,0.700654,13.366045
12,Mountain,Idaho,1297.0,715.0,1750536,2012.0,0.644632,7.409159
26,Mountain,Montana,983.0,422.0,1060665,1405.0,0.699644,9.267771
28,Mountain,Nevada,7058.0,486.0,3027341,7544.0,0.935578,23.314189
31,Mountain,New Mexico,1949.0,602.0,2092741,2551.0,0.764014,9.313145
44,Mountain,Utah,1904.0,972.0,3153550,2876.0,0.662031,6.037640
50,Mountain,Wyoming,434.0,205.0,577601,639.0,0.679186,7.513837

32. df[(df["variable1"] < 100) & (df["variable2"] == "example")]

In [421]:
# family_members degeri 1000 den kucuk olan ve region i Pacific  olan gozlemleri seciniz: fam_buyuk_1k_pac
fam_buyuk_1k_pac = df[(df['family_members']<1000) & (df['region']=='Pacific')]

# sonucu gorelim
fam_buyuk_1k_pac

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
1,Pacific,Alaska,1434.0,582.0,735139,2016.0,0.71131,19.506515

33. df["variable"] .isin([a,b,c,d])

BILGI:
colors = ["brown", "black", "tan"]
condition = dogs["color"].isin(colors)
dogs[condition]

veya

colors = ["brown", "black", "tan"]
dogs[ dogs["color"].isin(colors) ]

In [422]:
# region degiskeni   South Atlantic  veya  Mid-Atlantic  olan gozlemleri seciniz:  south_mid_atlantic
south_mid_atlantic = df[df['region'].isin(['South Atlantic','Mid-Atlantic'])]

# gorelim
south_mid_atlantic

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
7,South Atlantic,Delaware,708.0,374.0,965479,1082.0,0.654344,7.333148
8,South Atlantic,District of Columbia,3770.0,3134.0,701547,6904.0,0.546060,53.738381
9,South Atlantic,Florida,21443.0,9587.0,21244317,31030.0,0.691041,10.093523
10,South Atlantic,Georgia,6943.0,2556.0,10511131,9499.0,0.730919,6.605379
20,South Atlantic,Maryland,4914.0,2230.0,6035802,7144.0,0.687850,8.141420
30,Mid-Atlantic,New Jersey,6048.0,3350.0,8886025,9398.0,0.643541,6.806193
32,Mid-Atlantic,New York,39827.0,52070.0,19530351,91897.0,0.433387,20.392363
33,South Atlantic,North Carolina,6451.0,2817.0,10381615,9268.0,0.696051,6.213869
38,Mid-Atlantic,Pennsylvania,8163.0,5349.0,12800922,13512.0,0.604130,6.376884
40,South Atlantic,South Carolina,3082.0,851.0,5084156,3933.0,0.783626,6.061970
46,South Atlantic,Virginia,3928.0,2047.0,8501286,5975.0,0.657406,4.620477
48,South Atlantic,West Virginia,1021.0,222.0,1804291,1243.0,0.821400,5.658732

34. df[df['column'].isin(a_list)]

In [329]:
cities = ["California", "Arizona", "Nevada", "Utah"]

# state degiskeni  cities  listesinin icinde olan gozlemleri seciniz/filtreleyiniz:  cities_df
cities_df = df[df['state'].isin(cities)]

# gorelim
print(cities_df)

      region       state  individuals  family_members  state_pop
2   Mountain     Arizona       7259.0          2606.0    7158024
4    Pacific  California     109008.0         20964.0   39461588
28  Mountain      Nevada       7058.0           486.0    3027341
44  Mountain        Utah       1904.0           972.0    3153550

35. Simple Feature Engineering

In [424]:
# individuals  ve  family_members  degiskenlerinin toplamini belirten  total  adli bir degisken ekleyiniz
df['total'] =  df['individuals'] + df['family_members']  

# tek yasayan evsizlerin tum evsizlere olan oranini belirten bir degisken ekleyiniz: o_individuals
# bunu  individuals / total ile bulabiliriz:
df['o_individuals'] =  df['individuals'] / df['total'] 

# df.head() in son hali:
df.head()

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
0,East South Central,Alabama,2570.0,864.0,4887681,3434.0,0.748398,5.258117
1,Pacific,Alaska,1434.0,582.0,735139,2016.0,0.711310,19.506515
2,Mountain,Arizona,7259.0,2606.0,7158024,9865.0,0.735834,10.141067
3,West South Central,Arkansas,2280.0,432.0,3009733,2712.0,0.840708,7.575423
4,Pacific,California,109008.0,20964.0,39461588,129972.0,0.838704,27.623825

36. Simple Feature Engineering

In [340]:
# tek yasayan evsizlerin sehir populasyonuna oranini bulunuz, bu kisi basi kac tane evsiz oldugu anlamina gelir
# bu orani 10000 ile carparsak 10000 kiside kac tane evsiz vardir buna ulasiriz
# bu bilgiyi  indiv_per_10k  degisken adi ile df e ekleyiniz
df['indiv_per_10k'] =  (df['individuals'] / df['state_pop'] )*10000
print(df)

                region                 state  individuals  family_members  \
0   East South Central               Alabama       2570.0           864.0
1              Pacific                Alaska       1434.0           582.0
2             Mountain               Arizona       7259.0          2606.0
3   West South Central              Arkansas       2280.0           432.0
4              Pacific            California     109008.0         20964.0
5             Mountain              Colorado       7607.0          3250.0
6          New England           Connecticut       2280.0          1696.0
7       South Atlantic              Delaware        708.0           374.0
8       South Atlantic  District of Columbia       3770.0          3134.0
9       South Atlantic               Florida      21443.0          9587.0
10      South Atlantic               Georgia       6943.0          2556.0
11             Pacific                Hawaii       4131.0          2399.0
12            Mountain                 Idaho       1297.0           715.0
13  East North Central              Illinois       6752.0          3891.0
14  East North Central               Indiana       3776.0          1482.0
15  West North Central                  Iowa       1711.0          1038.0
16  West North Central                Kansas       1443.0           773.0
17  East South Central              Kentucky       2735.0           953.0
18  West South Central             Louisiana       2540.0           519.0
19         New England                 Maine       1450.0          1066.0
20      South Atlantic              Maryland       4914.0          2230.0
21         New England         Massachusetts       6811.0         13257.0
22  East North Central              Michigan       5209.0          3142.0
23  West North Central             Minnesota       3993.0          3250.0
24  East South Central           Mississippi       1024.0           328.0
25  West North Central              Missouri       3776.0          2107.0
26            Mountain               Montana        983.0           422.0
27  West North Central              Nebraska       1745.0           676.0
28            Mountain                Nevada       7058.0           486.0
29         New England         New Hampshire        835.0           615.0
30        Mid-Atlantic            New Jersey       6048.0          3350.0
31            Mountain            New Mexico       1949.0           602.0
32        Mid-Atlantic              New York      39827.0         52070.0
33      South Atlantic        North Carolina       6451.0          2817.0
34  West North Central          North Dakota        467.0            75.0
35  East North Central                  Ohio       6929.0          3320.0
36  West South Central              Oklahoma       2823.0          1048.0
37             Pacific                Oregon      11139.0          3337.0
38        Mid-Atlantic          Pennsylvania       8163.0          5349.0
39         New England          Rhode Island        747.0           354.0
40      South Atlantic        South Carolina       3082.0           851.0
41  West North Central          South Dakota        836.0           323.0
42  East South Central             Tennessee       6139.0          1744.0
43  West South Central                 Texas      19199.0          6111.0
44            Mountain                  Utah       1904.0           972.0
45         New England               Vermont        780.0           511.0
46      South Atlantic              Virginia       3928.0          2047.0
47             Pacific            Washington      16424.0          5880.0
48      South Atlantic         West Virginia       1021.0           222.0
49  East North Central             Wisconsin       2740.0          2167.0
50            Mountain               Wyoming        434.0           205.0

    state_pop     total  o_individuals  indiv_per_10k
0     4887681    3434.0       0.748398       5.258117
1      735139    2016.0       0.711310      19.506515
2     7158024    9865.0       0.735834      10.141067
3     3009733    2712.0       0.840708       7.575423
4    39461588  129972.0       0.838704      27.623825
5     5691287   10857.0       0.700654      13.366045
6     3571520    3976.0       0.573441       6.383837
7      965479    1082.0       0.654344       7.333148
8      701547    6904.0       0.546060      53.738381
9    21244317   31030.0       0.691041      10.093523
10   10511131    9499.0       0.730919       6.605379
11    1420593    6530.0       0.632619      29.079406
12    1750536    2012.0       0.644632       7.409159
13   12723071   10643.0       0.634408       5.306895
14    6695497    5258.0       0.718144       5.639611
15    3148618    2749.0       0.622408       5.434130
16    2911359    2216.0       0.651173       4.956448
17    4461153    3688.0       0.741594       6.130702
18    4659690    3059.0       0.830337       5.451006
19    1339057    2516.0       0.576312      10.828516
20    6035802    7144.0       0.687850       8.141420
21    6882635   20068.0       0.339396       9.895919
22    9984072    8351.0       0.623758       5.217310
23    5606249    7243.0       0.551291       7.122409
24    2981020    1352.0       0.757396       3.435066
25    6121623    5883.0       0.641849       6.168299
26    1060665    1405.0       0.699644       9.267771
27    1925614    2421.0       0.720777       9.062045
28    3027341    7544.0       0.935578      23.314189
29    1353465    1450.0       0.575862       6.169351
30    8886025    9398.0       0.643541       6.806193
31    2092741    2551.0       0.764014       9.313145
32   19530351   91897.0       0.433387      20.392363
33   10381615    9268.0       0.696051       6.213869
34     758080     542.0       0.861624       6.160300
35   11676341   10249.0       0.676066       5.934222
36    3940235    3871.0       0.729269       7.164547
37    4181886   14476.0       0.769481      26.636307
38   12800922   13512.0       0.604130       6.376884
39    1058287    1101.0       0.678474       7.058577
40    5084156    3933.0       0.783626       6.061970
41     878698    1159.0       0.721311       9.514077
42    6771631    7883.0       0.778764       9.065763
43   28628666   25310.0       0.758554       6.706215
44    3153550    2876.0       0.662031       6.037640
45     624358    1291.0       0.604183      12.492833
46    8501286    5975.0       0.657406       4.620477
47    7523869   22304.0       0.736370      21.829195
48    1804291    1243.0       0.821400       5.658732
49    5807406    4907.0       0.558386       4.718113
50     577601     639.0       0.679186       7.513837

In [425]:
# 10000 kiside 20 den fazla evsizin bulundugu sehirleri seciniz/filtreleyiniz, yeni df yi  high_df  adi ile kaydediniz
high_df =df[ df['indiv_per_10k'] > 20]
high_df

,region,state,individuals,family_members,state_pop,total,o_individuals,indiv_per_10k
4,Pacific,California,109008.0,20964.0,39461588,129972.0,0.838704,27.623825
8,South Atlantic,District of Columbia,3770.0,3134.0,701547,6904.0,0.546060,53.738381
11,Pacific,Hawaii,4131.0,2399.0,1420593,6530.0,0.632619,29.079406
28,Mountain,Nevada,7058.0,486.0,3027341,7544.0,0.935578,23.314189
32,Mid-Atlantic,New York,39827.0,52070.0,19530351,91897.0,0.433387,20.392363
37,Pacific,Oregon,11139.0,3337.0,4181886,14476.0,0.769481,26.636307
47,Pacific,Washington,16424.0,5880.0,7523869,22304.0,0.736370,21.829195

In [426]:
# high_df  dataframeini  indiv_per_10k  degiskenine gore buyukten kucuge dogru siralayiniz: high_df_srt
high_df_srt = high_df.sort_values(['indiv_per_10k'], ascending=False)

# high_df_srt  dataframinin  state  ve  indiv_per_10k   degiskenlerini seciniz: sonuc
sonuc = high_df_srt[['state','indiv_per_10k']]

# gorelim
sonuc

                   state  indiv_per_10k
8   District of Columbia      53.738381
11                Hawaii      29.079406
4             California      27.623825
37                Oregon      26.636307
28                Nevada      23.314189
47            Washington      21.829195
32              New York      20.392363

## Aggregating

### ozet istatistikler

In [344]:
import pandas as pd
# !!!  yukaridaki dataframe i df olarak kaydettik, buradaki dataframe i farkli bir isimle kaydedelim:
satislar = pd.read_pickle("walmart_sales.pkl")

37. satislar dataframe'inin ilk bes gozlemini yazdiriniz

In [345]:
satislar.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,2,2010-02-05,50605.27,False,5.727778,0.679451,8.106
2,1,A,3,2010-02-05,13740.12,False,5.727778,0.679451,8.106
3,1,A,4,2010-02-05,39954.04,False,5.727778,0.679451,8.106
4,1,A,5,2010-02-05,32229.38,False,5.727778,0.679451,8.106

38. satislar dataframe'i hakkinda yapisal bilgileri yazdirin

In [347]:
satislar.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 413119 entries, 0 to 413118
Data columns (total 9 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   store                 413119 non-null  int64
 1   type                  413119 non-null  object
 2   department            413119 non-null  int32
 3   date                  413119 non-null  datetime64[ns]
 4   weekly_sales          413119 non-null  float64
 5   is_holiday            413119 non-null  bool
 6   temperature_c         413119 non-null  float64
 7   fuel_price_usd_per_l  413119 non-null  float64
 8   unemployment          413119 non-null  float64
dtypes: bool(1), datetime64[ns](1), float64(4), int32(1), int64(1), object(1)
memory usage: 27.2+ MB

39. weekly_sales degiskeninin ortalamasini yazdiriniz:

In [349]:
print(satislar['weekly_sales'].mean())

16094.726811185497

40. weekly_sales degiskeninin ortanca degerini yazdiriniz:

In [356]:
print(satislar['weekly_sales'].median(axis = 0))

7682.47

41. Son satilan urun hangi tarihte satilmistir

In [369]:
print(satislar.sort_values('date', ascending = False))

        store type  department       date  weekly_sales  is_holiday  \
413118     45    B           8 2012-10-26      37857.64       False
266916     27    A           8 2012-10-26      47216.92       False
10182       1    A          11 2012-10-26      22399.83       False
10181       1    A          10 2012-10-26      26285.27       False
10180       1    A           9 2012-10-26      41040.84       False
...       ...  ...         ...        ...           ...         ...
157470     17    B           7 2010-02-05      11501.61       False
157471     17    B           8 2010-02-05      22462.70       False
157472     17    B           9 2010-02-05      12639.16       False
157473     17    B          10 2010-02-05      12323.85       False
0           1    A           1 2010-02-05      24924.50       False

        temperature_c  fuel_price_usd_per_l  unemployment
413118      14.916667              1.025516         8.667
266916      14.994444              1.075445         8.000
10182       20.644444              0.926188         6.573
10181       20.644444              0.926188         6.573
10180       20.644444              0.926188         6.573
...               ...                   ...           ...
157470      -4.938889              0.704283         6.548
157471      -4.938889              0.704283         6.548
157472      -4.938889              0.704283         6.548
157473      -4.938889              0.704283         6.548
0            5.727778              0.679451         8.106

[413119 rows x 9 columns]

In [374]:
satislar['date'].max()

Timestamp('2012-10-26 00:00:00')

42. Ilk satilan urun hangi tarihte satilmistir

In [375]:
satislar['date'].min()

Timestamp('2010-02-05 00:00:00')

43. satislar['variable'].agg(a_function)

df.column.agg(function)

df['column1','column2','column3'].agg(['function1','function2'])

In [376]:
# kendi tanimladigimiz bir IQR fonk u:
def iqr(kolon):
    """"Bu fonk, gelen kolonlarin 3.ceyrek degeri ile 1.ceyrek degeri arasindaki farki geri dondurur"""
    return kolon.quantile(0.75) - kolon.quantile(0.25)
    
# satis dataframe inin  temperature_c  degiskeninin  IQR  degerini yazdiralim
# DIKKAT! : bir fonk agg() ile kullanilinca () ve parametre kullanilmaz. 
# agg(fonk)  seklinde yazildiginda parametresini otomatik alir
print(satislar['temperature_c'].agg(iqr))

15.299999999999994

In [377]:
# yukaridaki gibi  temperature_c,  fuel_price_usd_per_l  ve  unemployment   degiskenlerinin IQR degerlerini yazdiriniz
print(satislar['fuel_price_usd_per_l'].agg(iqr))

0.21186608584010713

In [378]:
print(satislar['unemployment'].agg(iqr))

1.6719999999999988

In [382]:
import numpy as np
# yukaridaki kodu editleyip, iqr fonksiyonu ile birlikte np.median fonk unu da beraber aggregate ediniz
satislar[['temperature_c','fuel_price_usd_per_l','unemployment']].agg([iqr,np.median])

        temperature_c  fuel_price_usd_per_l  unemployment
iqr             15.30              0.211866         1.672
median          16.75              0.911922         7.852

## Kumulatif islemler

In [396]:
# store 1 ve department 1 secilip ilk 20 gozlem uzerinde calisalim: 
# bu dataframe'i satislar1 adiyla kaydedelim.
satislar1 = satislar[  (satislar['store']==1) & (satislar['department']==1 )  ]
satislar1 = satislar1[:20]

In [397]:
satislar1.head(10)

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
73,1,A,1,2010-02-12,46039.49,True,3.616667,0.673111,8.106
145,1,A,1,2010-02-19,41595.55,False,4.405556,0.664129,8.106
218,1,A,1,2010-02-26,19403.54,False,8.127778,0.676545,8.106
290,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
363,1,A,1,2010-03-12,21043.39,False,14.327778,0.704547,8.106
436,1,A,1,2010-03-19,22136.64,False,12.544444,0.718548,8.106
508,1,A,1,2010-03-26,26229.21,False,10.805556,0.721718,8.106
580,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
652,1,A,1,2010-04-09,42960.91,False,18.811111,0.731757,7.808

44. Feature Engineering: .cumsum() .cummax()

In [388]:
# satislar i date e gore siralayiniz ve ayni isimle kaydediniz: satislar1
satislar1 = satislar.sort_values('date')
print(satislar1)

        store type  department       date  weekly_sales  is_holiday  \
0           1    A           1 2010-02-05      24924.50       False
10287       2    A          48 2010-02-05       2357.00       False
10286       2    A          46 2010-02-05      30328.88       False
10285       2    A          45 2010-02-05         27.50       False
10284       2    A          44 2010-02-05       8788.47       False
...       ...  ...         ...        ...           ...         ...
157399     16    B           6 2012-10-26       2167.70       False
157400     16    B           7 2012-10-26       7285.14       False
157401     16    B           8 2012-10-26      15279.13       False
157403     16    B          10 2012-10-26      18290.34       False
413118     45    B           8 2012-10-26      37857.64       False

        temperature_c  fuel_price_usd_per_l  unemployment
0            5.727778              0.679451         8.106
10287        4.550000              0.679451         8.324
10286        4.550000              0.679451         8.324
10285        4.550000              0.679451         8.324
10284        4.550000              0.679451         8.324
...               ...                   ...           ...
157399       4.994444              0.973739         5.847
157400       4.994444              0.973739         5.847
157401       4.994444              0.973739         5.847
157403       4.994444              0.973739         5.847
413118      14.916667              1.025516         8.667

[413119 rows x 9 columns]

In [393]:
dat = satislar['date'].sort_values()
print(dat)

0        2010-02-05
10287    2010-02-05
10286    2010-02-05
10285    2010-02-05
10284    2010-02-05
            ...
157399   2012-10-26
157400   2012-10-26
157401   2012-10-26
157403   2012-10-26
413118   2012-10-26
Name: date, Length: 413119, dtype: datetime64[ns]

In [399]:
# satislar1 i weekly_sales e gore kumulatif toplamini aliniz ve 
# cum_weekly_sales adiyla yeni bir degisken olarak atayiniz
satislar1['cum_weekly_sales'] = satislar1.weekly_sales.cumsum()

# satislar1 i weekly_sales e gore kumulatif max ini aliniz ve 
# cum_max_sales adiyla yeni bir degisken olarak atayiniz
satislar1['cum_max_sales'] = satislar1.weekly_sales.cummax()

# ilgili degiskenleri secip yazdiriniz
print(satislar1[["date", "weekly_sales", "cum_weekly_sales", "cum_max_sales"]])

           date  weekly_sales  cum_weekly_sales  cum_max_sales
0    2010-02-05      24924.50          24924.50       24924.50
73   2010-02-12      46039.49          70963.99       46039.49
145  2010-02-19      41595.55         112559.54       46039.49
218  2010-02-26      19403.54         131963.08       46039.49
290  2010-03-05      21827.90         153790.98       46039.49
363  2010-03-12      21043.39         174834.37       46039.49
436  2010-03-19      22136.64         196971.01       46039.49
508  2010-03-26      26229.21         223200.22       46039.49
580  2010-04-02      57258.43         280458.65       57258.43
652  2010-04-09      42960.91         323419.56       57258.43
725  2010-04-16      17596.96         341016.52       57258.43
798  2010-04-23      16145.35         357161.87       57258.43
870  2010-04-30      16555.11         373716.98       57258.43
941  2010-05-07      17413.94         391130.92       57258.43
1013 2010-05-14      18926.74         410057.66       57258.43
1085 2010-05-21      14773.04         424830.70       57258.43
1155 2010-05-28      15580.43         440411.13       57258.43
1225 2010-06-04      17558.09         457969.22       57258.43
1296 2010-06-11      16637.62         474606.84       57258.43
1367 2010-06-18      16216.27         490823.11       57258.43

Bu soruda, satislar verisini tarihe gore siraladik, her hafta o haftaya kadar olan toplam satisi hesapladik, ve her hafta o haftaya kadar gecen haftalar icindeki max satisi mevcut haftaya yazdik.

45. df.drop_duplicates(['var1'])

In [400]:
satislar2 = satislar[['store','type','department','is_holiday']]

# store degiskeni tekrar eden gozlemleri teke dusurelim:  store
store = satislar2.drop_duplicates(['store'])
print(store.head())

# store/type ikilisi olarak tekrar eden gozlemleri teke dusurelim:  store_types
store_types = satislar2.drop_duplicates(['store','type'])
print(store_types.head())

# store/department ikilisi olarak tekrar eden gozlemleri teke dusurunuz:  store_depts
store_depts = satislar2.drop_duplicates(['store','department'])
print(store_depts.head())

       store type  department  is_holiday
0          1    A           1       False
10244      2    A           1       False
20482      3    B           1       False
29518      4    A           1       False
39790      5    B           1       False
       store type  department  is_holiday
0          1    A           1       False
10244      2    A           1       False
20482      3    B           1       False
29518      4    A           1       False
39790      5    B           1       False
   store type  department  is_holiday
0      1    A           1       False
1      1    A           2       False
2      1    A           3       False
3      1    A           4       False
4      1    A           5       False

In [430]:
# satislar in tatil olan gozlemlerini seciniz ve bunlar uzerinde date e gore tekrar edenleri teke dusurunuz (unique)
# satislar_tatil adi ile kaydediniz
satislar_tatil = satislar[satislar['is_holiday']==True].drop_duplicates(['date'])

# tatil iken haftalik satislari yazdiriniz
satislar_tatil[['date','weekly_sales']]

           date  weekly_sales
73   2010-02-12      46039.49
2218 2010-09-10      18194.74
3014 2010-11-26      18820.29
3372 2010-12-31      19124.58
3800 2011-02-11      37887.17
5940 2011-09-09      17746.68
6731 2011-11-25      20911.25
7096 2011-12-30      23350.88
7527 2012-02-10      36988.49
9667 2012-09-07      18322.37

46. df['variable'].value_counts()

In [436]:
# Tipindf['variable'].value_counts e gore magaza sayilarini bulunuz: 
store_count = store['type'].value_counts()
store_count

A    22
B    17
C     6
Name: type, dtype: int64

47. df['variable'].value_counts(normalize=True)

In [433]:
# Tipine gore magaza oranlarini bulunuz:
store['type'].value_counts(normalize=True)

A    0.488889
B    0.377778
C    0.133333
Name: type, dtype: float64

48. df['variable'].value_counts(sort=True)

In [440]:
# Tipine gore magazalarin departman sayilari, sirali olarak yazdiriniz: 
dept_counts_sorted = store_depts['department'].value_counts(sort=True)
dept_counts_sorted

1     45
9     45
4     45
6     45
8     45
      ..
37    20
50    14
43     5
39     5
65     1
Name: department, Length: 81, dtype: int64

45 magazada departman1 varmis
45 magazada departman9 varmis
...
sadece 1 tane magazada departman65 varmis

In [ ]:
# yukaridaki sonucun oransal degerleri ve siralanmis hali berabear yazdiralim:
dept_props_sorted = store_depts['department'].value_counts(sort=True, normalize=True)
print(dept_props_sorted)

49.

In [412]:
# Haftalik satislarin tumunun toplami:
satislar_hepsi = satislar["weekly_sales"].sum()
print(satislar_hepsi)

6649037445.509999

In [443]:
# A tipinde olan magazalarin tumunun hafalik satis toplamini hesaplayiniz: satislar_A adi ile kaydedinz
satislar_A = satislar[satislar['type']=='A']['weekly_sales'].sum()
satislar_A

4331014722.749999

In [450]:
# B tipinde olan magazalarin tumunun haftalik satis toplamini hesaplayiniz: satislar_B adi ile kaydedinz
satislar_B = satislar[satislar['type']=='B']['weekly_sales'].sum()

In [451]:
# C tipinde olan magazalarin tumunun haftalik satis toplamini hesaplayiniz: satislar_C adi ile kaydedinz
satislar_C = satislar[satislar['type']=='C']['weekly_sales'].sum()

print([satislar_A, satislar_B, satislar_C])


# Herbirinin oranlari:
satislarin_oranlari = [satislar_A, satislar_B, satislar_C] / satislar_hepsi
print(satislarin_oranlari)

[4331014722.749999, 1912519195.2199998, 405503527.53999996]
[0.65137469 0.28763851 0.0609868 ]

50.

In [452]:
# type a gore guruplayiniz, magaza tiplerinin haftalik satis toplamlarini bulunuz: satislar_tipe_gore
satislar_tipe_gore = satislar.groupby('type')['weekly_sales'].sum()
print( satislar_tipe_gore )

type
A    4.331015e+09
B    1.912519e+09
C    4.055035e+08
Name: weekly_sales, dtype: float64

In [453]:
# satis miktarlarini (uc tipin miktarlari) toplamlarina bolerek oranlarini bulunuz
satislar_orani = satislar_tipe_gore/sum(satislar_tipe_gore)
print(satislar_orani)

type
A    0.651375
B    0.287639
C    0.060987
Name: weekly_sales, dtype: float64

In [454]:
# haftalik satislari tip ve tatil durumuna a gore guruplayiniz, 
# (cift guruplama: ornegin tipi A olan magazada tatil olma durumuna gore satis sayilari ... gibi)

satislar_tip_ve_tatile_gore = satislar.groupby(['type','is_holiday'])['weekly_sales'].sum()

satislar_tip_ve_tatile_gore

type  is_holiday
A     False         4.007612e+09
      True          3.234028e+08
B     False         1.765411e+09
      True          1.471081e+08
C     False         3.772478e+08
      True          2.825570e+07
Name: weekly_sales, dtype: float64